improve readme formatting
